[{"text": ""}, {"text": "Viswa Sai Ammiraju Bonam\nRichardson, Texas, 75080| +1 (945) 243 4479| viswa.bonam@utdallas.edu | linkedin.com/in/viswabonam\nEducation\nThe University of Texas at Dallas Richardson, Texas\nMaster of Science in Financial Technology and Analytics; GPA: 3.846/4 Aug 2023 - May 2025\nJNTUH College of Engineering Hyderabad, India\nBachelor of Technology in Mechanical Engineering; GPA: 3.7/4 Aug 2018 - Jun 2022\nProfessional Experience\nFinancial Analyst and Machine Learning Specialist Jul 2024 – Aug 2024\nUTDSOM Investment Corporation Richardson, United States\n• Developed a machine learning model usingPython and Scikit-learn, increasing prediction accuracy by 20% for quarterly\nstock returns using financial statements and SEC filings.\n• Identified top-performing stocks by ranking them based on expected returns usingExcel and financial modeling, generating a\n10% increase in portfolio returns after accounting for trading costs.\n• Segmented data intoestimation, validation, and forecast samplesusing advanced statistical techniques withPandas\nand NumPy, improving the reliability of stock ranking by 15%.\nAssociate Database Developer Nov 2022 – Jan 2023\nSkyEss Techno Solutions Hyderabad, India\n• Developed and optimized SQL-based databases by leveraging data modeling and analysis withMySQL, reducing data retrieval\ntime by 30% and improving data-driven decision-making for business requirements.\n• Collaborated with UI/UX and data teams by integrating backend data using Python and Pandas into front-end interfaces,\nwhich improved user interaction efficiency by 25% for hospitality guest management systems.\n• Analyzed business process cycles and created ad-hoc reports using SQL andExcel, increasing reporting accuracy by 40% while\nensuring data consistency throughdata validationtechniques.\nProjects\nReal-Time Data Streaming & Analytics with Kafka, Zookeeper, S3, and Athena on AWS.(UT Dallas)\n• Architected a real-time data pipeline by deploying Kafka and Zookeeper on AWS EC2, seamlessly streaming thousands of\nmessages per second andreducing data latencyfrom hours to near-instant.\n• Integrated Amazon S3 and Athena for on-demandquerying of streamed data,cutting analysis timeby 40% and enabling\nrapid, data-driven decision-making.\n• Automated end-to-end ingestion using customized Kafka Producer and Consumer scripts, ensuring reliable data capture while\nmaintaining a99.9% uptimeacross the pipeline.\nAmerican Express Credit Default Prediction(UT Dallas)\n• Developed a machine learning model usingXGBoost and Neural Network modelby applyinghyperparameter tuning\nand feature engineering, which resulted in a 94.7% AUC score.\n• Engineered key variables (delinquency, spend, balance) usingPython and Pandas, reducing overfitting and improving model\nstability.\n• Implemented credit scoring strategies using advancedstatistical analysis, reducing default rates to 5% and 10%, enhancing\ndecision-making and profitability.\nEquity Insight: AI-Driven News Analysis Tool(Personal)\n• Built an automated news research tool usingLangChain, OpenAI, RAG, andPython, reducing manual article review time\nby 60% and accelerating equity analysis insights.\n• Utilized FAISS vector databaseto optimizesemantic searchacross articles, improving query accuracy by 35%.\n• Deployed Streamlit UI that improved user experience, delivered real-time insights, and increased productivity by 50% for\nequity analysts.\nBitcoin Return Prediction with Multivariate Asset Integration(UT Dallas)\n• Created a predictive model for Bitcoin returns withXGBoost, improving classification accuracy by 15% throughfeature\nselection and missing data imputation.\n• Enhanced model by applyingSHAP analysis to select the top 20 features, reducing noise by 40% and optimizing feature\nrelevance for better predictions.\n• Leveraged multivariate asset data for enhanced decision-making, improving model interpretability and performance by 20%.\nSkills\nProgramming Languages: SQL, Python, R, Java\nData Science & Analytics:Feature Engineering, Predictive Modeling, Data Preprocessing, Model Tuning\nData Visualization: PowerBI, Tableau, Matplotlib, Seaborn\nCloud Platforms: AWS, Azure (Microsoft Certified: Azure Data Scientist Associate)\nOther: Apache Spark, Cassandra, Kafka, Data Mining, Web Scraping, NLP, Deep Learning, Tensorflow, LangChain, FAISS\n\n"}, {"text": "FAQ: Viswa Sai Ammiraju Bonam\n\nQ1: What is your current academic program and when will you graduate?\nA: I pursued a Master of Science in Financial Technology and Analytics at The University of Texas at Dallas, with a GPA of 3.830/4. I graduated in May 2025.\n\nQ2: What is your educational background?\nA: I hold a Bachelor of Technology in Mechanical Engineering from JNTUH College of Engineering, Hyderabad, India, with a GPA of 3.7/4.\n\nQ3: What technical skills do you have?\nA: I am proficient in Python, SQL, R, and Java. I have experience with tools and platforms like AWS, Azure, Apache Spark, Kafka, Cassandra, Scikit-learn, TensorFlow, LangChain, and FAISS. I also work with data visualization tools like Power BI, Tableau, Matplotlib, and Seaborn.\n\n"}, {"text": "Q4: What are your key projects?\nA: \n- **American Express Credit Default Prediction**: Built models using XGBoost and Neural Networks, achieving a 94.7% AUC score. Applied credit scoring strategies and feature engineering to reduce default rates and enhance model reliability.\n- **Equity Insight Chatbot**: Developed a news-driven research tool using LangChain, OpenAI, and Streamlit to analyze financial news with RAG pipelines and FAISS, improving query accuracy and equity research efficiency.\n- **Real-Time Stock Data Analytics on AWS**: Streamed high-frequency data using Kafka and Zookeeper, storing it in S3 and querying it with Athena. Automated the entire pipeline with 99.9% uptime.\n- **Bitcoin Return Prediction**: Used multivariate financial indicators and SHAP analysis to build an XGBoost model for predicting returns, increasing accuracy and interpretability.\n- **Stock Ranking with SEC Filings**: At UTDSOM Investment Corp, developed models to predict quarterly stock returns using SEC filings, increasing portfolio return by 10% and boosting model accuracy by 20%.\n\n"}, {"text": "Q5: What industry experience do you have?\nA: \n- At **UTDSOM Investment Corporation**, I worked as a Financial Analyst and Machine Learning Specialist, where I improved prediction accuracy of stock returns and applied financial modeling techniques to enhance portfolio returns.\n- As an **Associate Database Developer** at SkyEss Techno Solutions, I optimized MySQL databases and integrated backend Python code into UI systems, reducing data retrieval time and enhancing reporting accuracy.\n\nQ6: What are your current career goals?\nA: I aim to work in roles that combine financial technology, machine learning, and data analytics, particularly in the fintech, AI, or quant finance sectors.\n\nQ7: Do you have any student or volunteering experience?\nA: \n- Starbucks Volunteer at UTD (since Sep 2023)\n- Robin Hood Army Volunteer, Hyderabad (Mar–May 2023)\n- Student Coordinator at JNTUH College of Engineering (2017–2020)\n\n"}, {"text": "Q8: What are your interests beyond academics?\nA: I'm interested in animation and content creation. I explored Adobe After Effects and Audition under a personal project idea called \"Dawdoodle Animations\" and enjoy learning visual storytelling.\n\nQ9: What is your availability for part-time work?\nA: While my primary focus is full-time roles, I am open to impactful internship or part-time opportunities if they align with my long-term career goals.\n\nQ10: What can this chatbot help with?\nA: This chatbot answers questions based on my resume and FAQ document. You can ask about my experience, education, projects, skills, interests, and work availability.\n\nQ11: What is your work authorization or sponsorship status?\nA: I am on an F-1 visa with OPT (Optional Practical Training) and eligible to work in the United States for up to 3 years in STEM fields without requiring H-1B sponsorship during that period. I am authorized to begin full-time employment immediately.\n\n"}]