[{"text": ""}, {"text": "Viswa Sai Ammiraju Bonam\nRichardson, Texas, 75080| +1 (945) 243 4479| viswa.bonam@utdallas.edu | linkedin.com/in/viswabonam\nEducation\nThe University of Texas at Dallas Richardson, Texas\nMaster of Science in Financial Technology and Analytics; GPA: 3.846/4 Aug 2023 - May 2025\nJNTUH College of Engineering Hyderabad, India\nBachelor of Technology in Mechanical Engineering; GPA: 3.7/4 Aug 2018 - Jun 2022\nProfessional Experience\nFinancial Analyst and Machine Learning Specialist Jul 2024 – Aug 2024\nUTDSOM Investment Corporation Richardson, United States\n• Developed a machine learning model usingPython and Scikit-learn, increasing prediction accuracy by 20% for quarterly\nstock returns using financial statements and SEC filings.\n• Identified top-performing stocks by ranking them based on expected returns usingExcel and financial modeling, generating a\n10% increase in portfolio returns after accounting for trading costs.\n• Segmented data intoestimation, validation, and forecast samplesusing advanced statistical techniques withPandas\nand NumPy, improving the reliability of stock ranking by 15%.\nAssociate Database Developer Nov 2022 – Jan 2023\nSkyEss Techno Solutions Hyderabad, India\n• Developed and optimized SQL-based databases by leveraging data modeling and analysis withMySQL, reducing data retrieval\ntime by 30% and improving data-driven decision-making for business requirements.\n• Collaborated with UI/UX and data teams by integrating backend data using Python and Pandas into front-end interfaces,\nwhich improved user interaction efficiency by 25% for hospitality guest management systems.\n• Analyzed business process cycles and created ad-hoc reports using SQL andExcel, increasing reporting accuracy by 40% while\nensuring data consistency throughdata validationtechniques.\nProjects\nReal-Time Data Streaming & Analytics with Kafka, Zookeeper, S3, and Athena on AWS.(UT Dallas)\n• Architected a real-time data pipeline by deploying Kafka and Zookeeper on AWS EC2, seamlessly streaming thousands of\nmessages per second andreducing data latencyfrom hours to near-instant.\n• Integrated Amazon S3 and Athena for on-demandquerying of streamed data,cutting analysis timeby 40% and enabling\nrapid, data-driven decision-making.\n• Automated end-to-end ingestion using customized Kafka Producer and Consumer scripts, ensuring reliable data capture while\nmaintaining a99.9% uptimeacross the pipeline.\nAmerican Express Credit Default Prediction(UT Dallas)\n• Developed a machine learning model usingXGBoost and Neural Network modelby applyinghyperparameter tuning\nand feature engineering, which resulted in a 94.7% AUC score.\n• Engineered key variables (delinquency, spend, balance) usingPython and Pandas, reducing overfitting and improving model\nstability.\n• Implemented credit scoring strategies using advancedstatistical analysis, reducing default rates to 5% and 10%, enhancing\ndecision-making and profitability.\nEquity Insight: AI-Driven News Analysis Tool(Personal)\n• Built an automated news research tool usingLangChain, OpenAI, RAG, andPython, reducing manual article review time\nby 60% and accelerating equity analysis insights.\n• Utilized FAISS vector databaseto optimizesemantic searchacross articles, improving query accuracy by 35%.\n• Deployed Streamlit UI that improved user experience, delivered real-time insights, and increased productivity by 50% for\nequity analysts.\nBitcoin Return Prediction with Multivariate Asset Integration(UT Dallas)\n• Created a predictive model for Bitcoin returns withXGBoost, improving classification accuracy by 15% throughfeature\nselection and missing data imputation.\n• Enhanced model by applyingSHAP analysis to select the top 20 features, reducing noise by 40% and optimizing feature\nrelevance for better predictions.\n• Leveraged multivariate asset data for enhanced decision-making, improving model interpretability and performance by 20%.\nSkills\nProgramming Languages: SQL, Python, R, Java\nData Science & Analytics:Feature Engineering, Predictive Modeling, Data Preprocessing, Model Tuning\nData Visualization: PowerBI, Tableau, Matplotlib, Seaborn\nCloud Platforms: AWS, Azure (Microsoft Certified: Azure Data Scientist Associate)\nOther: Apache Spark, Cassandra, Kafka, Data Mining, Web Scraping, NLP, Deep Learning, Tensorflow, LangChain, FAISS\n\n"}, {"text": "Q: Where did you study?\nA: I earned my Master of Science in Financial Technology and Analytics from The University of Texas at Dallas, and my Bachelor of Technology in Mechanical Engineering from JNTUH College of Engineering, Hyderabad.\n\nQ: What are your core technical skills?\nA: Python, SQL, AWS, machine learning (scikit-learn, XGBoost), data engineering (Kafka, S3, Athena), and GenAI (LangChain, OpenAI API).\n\nQ: Which cloud platforms do you work with?\nA: I have experience with AWS (S3, Lambda, Kinesis, Athena), and I’m familiar with Google Cloud’s Vertex AI.\n\nQ: What kind of projects have you built?\nA: I’ve built an LLM-powered equity research analysis tool (RAG chatbot) using LangChain, OpenAI and Streamlit, plus a real-time Kafka–Athena data streaming pipeline.\n\nQ: How can I contact you?\nA: Email me at vsb230000@utdallas.edu or connect on LinkedIn: linkedin.com/in/viswabonam.\n\n"}, {"text": "Q: Do you take on freelance or consulting work?\nA: I’m open to part-time and contract engagements up to 20 hours/week. Feel free to reach out with details of the opportunity.\n\nQ: What are your career goals?\nA: I’m focused on leveraging AI and data engineering to build scalable fintech solutions—especially in algorithmic trading and GenAI-driven analytics.\n\nQ: Can I see your resume or portfolio?\nA: Absolutely—everything’s available right here on this site. Feel free to explore my projects and download my resume PDF.\n\nQ: How do you approach problem-solving?\nA: I break challenges into data-driven hypotheses, validate with exploratory analysis, and iterate using production-ready code and cloud infrastructure.\n\nQ: What’s your availability?\nA: Outside of my MS class schedule (M–W 7–9:45 PM, Fri 4–6:45 PM), I’m generally available any time on Thursday, Saturday, and Sunday.\n\n\n"}]